Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetWalkLines
Gets walk lines.
Returns:
The walk lines.
Since:
2015

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetBoundaryLines
Gets boundary lines.
Returns:
The boundary lines.
Since:
2015

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetTreadsLength
Gets the length of treads.
Returns:
The length of treads.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetNumberOfTreads
Gets the number of treads.
Returns:
The list of numbers of treads.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetNumberOfRisers
Gets the number of risers.
Returns:
The list of numbers of risers.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetStringerGeometries
Gets the geometries of stringers.
Returns:
The geometries of stringers.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetLandingGeometries
Gets the geometries of landings.
Returns:
The geometries of landings.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetRunGeometries
Gets the geometries of runs.
Returns:
The geometries of runs.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.IsRamp
True if it is a ramp, false if it is a stair.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.RiserHeight
The height of riser.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp
The class contains the components of a legacy stair or ramp.
Since:
2013